import re


# Користувач запитує в асистента за найближчу музичну подію певного виконавця
scenario1 = re.compile(
    r'(де|коли) (відбудеться |буде проходити )?(наступний|найближчий) (концерт|виступ) виконавця ([а-яґєіїa-z]+)( [а-яґєіїa-z]+)?\??$',
    re.IGNORECASE
)


# Користувач запитує в асистента за всі заплановані події певного виконавця
scenario2 = re.compile(
    r'які (музичні події|концерти) заплановані у виконавця ([а-яґєіїa-z]+)( [а-яґєіїa-z]+)?( найближчим часом)?\??$',
    re.IGNORECASE
)
scenario3 = re.compile(
    r'(можеш )?(розказати|розкажи) про заплановані (музичні події|концерти) виконавця ([а-яґєіїa-z]+)( [а-яґєіїa-z]+)?( найближчим часом)?\??$',
    re.IGNORECASE
)


# Користувач запитує в асистента за найближчу подію в певному місті
scenario4 = re.compile(
    r'як(а|у|ий) найближч(а|у|ий) (музичн(а|у|ий) )?(поді([яю])|концерт) (відбудеться|я можу відвідати) ([ув]) місті ([а-яґєії-]+)( [а-яґєії-]+)?\??$',
    re.IGNORECASE
)


# Користувач запитує в асистента за список найближчих подій в певному місті
scenario5 = re.compile(
    r'куди я можу (піти|сходити) ([ув]) місті ([а-яґєії-]+)( [а-яґєії-]+)?( найближчим часом)?\??$',
    re.IGNORECASE
)


# Користувач запитує в асистента за найближчу музичну подію певного виконавця в певному місті
scenario6 = re.compile(
    r'коли( відбудеться| буде проходити)? (наступний|найближчий) (концерт|виступ) виконавця ([а-яґєіїa-z]+)( [а-яґєіїa-z]+)? ([ув]) місті ([а-яґєії-]+)( [а-яґєії-]+)?\??$',
    re.IGNORECASE
)


scenarios_user = [scenario1, scenario2, scenario3, scenario4, scenario5, scenario6]


# Адміністратор додає нову музичну подію до БД
scenario_manager = re.compile(
    r'(я )?(б )?хо(тів|чу) (би )?(додати|внести) (нову )?(музичну )?подію',
    re.IGNORECASE
)
